In [1]:
#pip install schedule

In [1]:
import pandas as pd
import shutil, os, glob
import pymongo
from pymongo import MongoClient
import json
import schedule
import time

## Extract

for f in glob('input' + '\*.csv'):
    df = pd.read_csv(f)

In [3]:
df = pd.concat(map(pd.read_csv, glob.glob('input' + '\*.csv')))
#Extract All source code
#https://stackoverflow.com/questions/20906474/import-multiple-csv-files-into-pandas-and-concatenate-into-one-dataframe

In [13]:
df.head()

,City,City_ID,Cloudiness,Country,Date,Humidity,Lat,Lng,Max Temp,Pop_Rank,...,rentals_handgun,rentals_long_gun,return_to_seller_handgun,return_to_seller_long_gun,return_to_seller_other,returned_handgun,returned_long_gun,returned_other,state,totals
0,jacareacanga,0.0,0.0,BR,1.528902e+09,62.0,-6.22,-57.76,89.60,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,kaitangata,1.0,100.0,NZ,1.528905e+09,94.0,-46.28,169.85,42.61,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,goulburn,2.0,20.0,AU,1.528905e+09,91.0,-34.75,149.72,44.32,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,lata,3.0,76.0,IN,1.528905e+09,89.0,30.78,78.62,59.89,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,chokurdakh,4.0,0.0,RU,1.528905e+09,88.0,70.62,147.90,32.17,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
len(df)

250

## Transform Hash

In [6]:
df['hash'] = pd.Series((hash(tuple(row)) for _, row in df.iterrows()))
#Hash Code
#https://stackoverflow.com/questions/25757042/create-hash-value-for-each-row-of-data-with-selected-columns-in-dataframe-in-pyt
df.head()

,YEAR,STATE,RATE,DEATHS,URL,hash
0,2017,Alabama,22.9,"1,124",/nchs/pressroom/states/alabama/alabama.htm,-617692814812755799
1,2017,Alaska,24.5,180,/nchs/pressroom/states/alaska/alaska.htm,-9045459844361817229
2,2017,Arizona,15.8,"1,134",/nchs/pressroom/states/arizona/arizona.htm,4715725535199337868
3,2017,Arkansas,20.3,613,/nchs/pressroom/states/arkansas/arkansas.htm,3048597109707358623
4,2017,California,7.9,"3,184",/nchs/pressroom/states/california/california.htm,3652844115538918373

In [7]:
len(df)

250

## Transform Dedupe

In [8]:
df_nodupe = df[~df.duplicated()]
#Dedupe code source
#https://stackoverflow.com/questions/40438237/assign-hash-to-row-of-categorical-data-in-pandas

In [9]:
df_nodupe.head()

,YEAR,STATE,RATE,DEATHS,URL,hash
0,2017,Alabama,22.9,"1,124",/nchs/pressroom/states/alabama/alabama.htm,-617692814812755799
1,2017,Alaska,24.5,180,/nchs/pressroom/states/alaska/alaska.htm,-9045459844361817229
2,2017,Arizona,15.8,"1,134",/nchs/pressroom/states/arizona/arizona.htm,4715725535199337868
3,2017,Arkansas,20.3,613,/nchs/pressroom/states/arkansas/arkansas.htm,3048597109707358623
4,2017,California,7.9,"3,184",/nchs/pressroom/states/california/california.htm,3652844115538918373

In [10]:
len(df_nodupe)

250

## Load

#### > Convert DataFrame to json formatted file

In [11]:
import json

In [12]:
df_nodupe.to_json('ETL_json_file', orient='index')
# Converting dataframe data to json format
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_json.html

In [13]:
json_data = df_nodupe.to_json(orient='index')
parsed = json.loads(json_data)
# print(json.dumps(parsed, indent=4, sort_keys=True))
# Un-comment print to pretty print json formated data

#### > Create MongoDB named 'etl_db' with a collection 'etl_data'

In [14]:
import pymongo
from pymongo import MongoClient
client = MongoClient()
client = MongoClient('localhost', 27017)
client = MongoClient('mongodb://localhost:27017/')
print('Mongo version', pymongo.__version__)

Mongo version 3.9.0

In [15]:
# Uncomment code to drop existing database before creating new one
# client.drop_database('etl_db')

In [16]:
db = client['etl_db']
# Create database named 'etl_db'

db.etl_data.drop() # Drop collection if it already exist

collection = db['etl_data']
# Create collection called 'etl_data'

#### > Load ETL_json_file data

In [17]:
with open('ETL_json_file') as f:
    file_data = json.load(f)
    collection.insert_one(file_data) 
client.close()
# Read json file into mongoDB
# https://stackoverflow.com/questions/49510049/how-to-import-json-file-to-mongodb-using-python

In [18]:
db.list_collection_names()
# List collections in database

['etl_data']

In [19]:
db.etl_data.find( { 0: {} } )

In [20]:
# cursor = db.etl_data # selecting the etl_data collection
# for document in cursor.find():
#    print (document)
# Printing the content of the collection LARGE PRINTOUT

#### > Reading content of database and loading it into a dataframe

In [21]:
extracted_etl_data = db.etl_data
df = pd.DataFrame(list(extracted_etl_data.find()))
# https://stackoverflow.com/questions/16249736/how-to-import-data-from-mongodb-to-pandas

In [22]:
df

,0,1,10,100,101,102,103,104,105,106,...,91,92,93,94,95,96,97,98,99,_id
0,"{'YEAR': 2017, 'STATE': 'Alabama ', 'RATE': 22...","{'YEAR': 2017, 'STATE': 'Alaska ', 'RATE': 24....","{'YEAR': 2017, 'STATE': 'Hawaii', 'RATE': 2.5,...","{'YEAR': 2015, 'STATE': 'AL', 'RATE': 19.6, 'D...","{'YEAR': 2015, 'STATE': 'AK', 'RATE': 23.4, 'D...","{'YEAR': 2015, 'STATE': 'AZ', 'RATE': 13.8, 'D...","{'YEAR': 2015, 'STATE': 'AR', 'RATE': 16.9, 'D...","{'YEAR': 2015, 'STATE': 'CA', 'RATE': 7.7, 'DE...","{'YEAR': 2015, 'STATE': 'CO', 'RATE': 12.6, 'D...","{'YEAR': 2015, 'STATE': 'CT', 'RATE': 5.3, 'DE...",...,"{'YEAR': 2016, 'STATE': 'TN', 'RATE': 17.1, 'D...","{'YEAR': 2016, 'STATE': 'TX', 'RATE': 12.1, 'D...","{'YEAR': 2016, 'STATE': 'UT', 'RATE': 12.9, 'D...","{'YEAR': 2016, 'STATE': 'VT', 'RATE': 11.1, 'D...","{'YEAR': 2016, 'STATE': 'VA', 'RATE': 12.1, 'D...","{'YEAR': 2016, 'STATE': 'WA', 'RATE': 9.0, 'DE...","{'YEAR': 2016, 'STATE': 'WV', 'RATE': 17.5, 'D...","{'YEAR': 2016, 'STATE': 'WI', 'RATE': 11.4, 'D...","{'YEAR': 2016, 'STATE': 'WY', 'RATE': 17.4, 'D...",5d6f1020e37baffe9d890289

In [23]:
df = df.melt()

In [24]:
df.head()

  variable                                              value
0        0  {'YEAR': 2017, 'STATE': 'Alabama ', 'RATE': 22...
1        1  {'YEAR': 2017, 'STATE': 'Alaska ', 'RATE': 24....
2       10  {'YEAR': 2017, 'STATE': 'Hawaii', 'RATE': 2.5,...
3      100  {'YEAR': 2015, 'STATE': 'AL', 'RATE': 19.6, 'D...
4      101  {'YEAR': 2015, 'STATE': 'AK', 'RATE': 23.4, 'D...

In [25]:
len(df)

251

In [26]:
df.iloc[0][1]
# Showing content of first row 'value'

{'YEAR': 2017,
 'STATE': 'Alabama ',
 'RATE': 22.9,
 'DEATHS': '1,124',
 'URL': '/nchs/pressroom/states/alabama/alabama.htm',
 'hash': -617692814812755799}

#### > CSV Move script - moves .csv files after being ETL processed

In [27]:
import shutil, os, glob

In [28]:
#For Loop moving all .csv files from the test_input folder 
for filePath in glob.glob('input' + '\*.csv'):
            #Move each file to the destination directory
        shutil.move(filePath, 'processed');
# Move all files that have been ETL'ed into a processed folder
#Source Code           
#https://thispointer.com/python-how-to-move-files-and-directories/

##Schedule ETL Jobs

In [29]:
#pip install schedule

#Source Code
#https://github.com/dbader/schedule
import schedule
import time

def job():
    print("Performing an ETL process...")

schedule.every(1).minutes.do(job)

while 1:
    schedule.run_pending()
    time.sleep(1)